<template>
  <div class="bg-[#F5F5F3]">
    <div class="container">
      <div class="h-[100vh] pt-[75px]">
        <h1 class="text-[30px] text-[#4F4849] x">
          Ыбырай Алтынсарин атындағы жалпы орта білім беретін мектеп
        </h1>
        <div class="flex pt-[155px]">
          <img
            src="https://qazaq1913.com/wp-content/uploads/2021/02/2020_11_05_whatsapp-image-2020-11-02-at-14.02.53.jpeg"
            alt=""
            class="rounded-[35px] w-[700px]"
          />
          <div class="font-200 ml-[25px] text-[17px] text-[#4F4849]">
            <p>
              Құрметті Достар! Біз сізді әр оқушының өз әлеуетін ашуға,
              дағдылары мен білімін дамытуға, сондай-ақ табысқа жетудің бірегей
              жолын табуға мүмкіндігі бар білім беру оқу ортасында қарсы алуға
              қуаныштымыз. Біздің мұғалімдеріміз-оқушыларымыз үшін ынталандырушы
              және қолдаушы жағдай жасауға ұмтылатын тәжірибелі және адал
              мамандар. <br />
            </p>
            <p class="pt-[15px]">
              Біз әр балаға өз таланттарын ашуға және жеке мақсаттарына жетуге
              мүмкіндік беретін жеке көзқарасқа сенеміз. "Ыбырай Алтынсарин"
              мектебi біз тек академиялық жетістіктерді ғана емес,
              оқушыларымыздың жан-жақты дамуын да бағалаймыз. Біз оқушыларымыз
              көкжиектерін кеңейтіп, жаңа дағдыларға ие болуы үшін сабақтан тыс
              іс-шараларға, спорттық жарыстарға, шығармашылық байқауларға және
              экскурсияларға қатысуға шақырамыз.
            </p>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div class="">
    <div class="container">
      <div class="h-[100vh] pt-[75px]">
        <h1 class="text-[30px] text-[#4F4849] font-black">
          Оқушыларға, ата-аналарға және мұғалімдерге пайдасы
        </h1>
        <div class="flex pt-[105px] justify-between">
          <div class="w-[700px] border p-[15px] rounded-[25px] text-[20px]">
            <p v-if="student">
              Оқушыларға: <br />
              <span class="text-[#a69781] font-bold"> Сапалы білім:</span>
              біз студенттерге академиялық дағдыларды дамытуға және оқу пәндері
              туралы терең түсінік алуға көмектесетін заманауи әдістер мен
              бағдарламаларға негізделген сапалы білім береміз. Жеке көзқарас:
              біз әр оқушының бірегейлігін бағалаймыз және олардың оқу және жеке
              дамуына жеке қолдау мен көмек көрсетуге тырысамыз. Біздің
              мұғалімдер мен тәрбиешілер әр оқушыға өз мақсаттарына жетуге
              көмектесуге дайын. <br />
              <span class="text-[#a69781] font-bold">
                Әр түрлі сабақтан тыс мүмкіндіктер:</span
              >
              біз студенттердің қызығушылықтары мен таланттарын дамыту үшін әр
              түрлі сабақтан тыс іс-шараларды, спорт клубтарын, өнер
              үйірмелерін, ғылыми жобаларды және басқа да әрекеттерді ұсынамыз.
              <br />
              <span class="text-[#a69781] font-bold"> Болашаққа дайындық:</span>
              біздің мектеп оқушыларды қазіргі әлемде сәтті бейімделуге
              дайындауға тырысады. Біз болашақ мансап пен өмірде пайдалы болатын
              сыни ойлау, қарым-қатынас, ынтымақтастық және проблемалық шешім
              дағдыларын дамытуға баса назар аударамыз.
            </p>
            <p v-if="teacher">
              Мұғалімдерге <br />

              <span class="text-[#a69781] font-bold"> Кәсіби даму:</span>

              біз мұғалімдерімізді бағалаймыз және оларға кәсіби даму, оқыту
              және тәжірибе алмасу мүмкіндіктерін ұсынамыз. Біз мұғалімдерді
              педагог ретінде олардың тұрақты дамуы мен өсуінде қолдаймыз.
              <br />
              <span class="text-[#a69781] font-bold"
                >Ресурстар мен материалдар:
              </span>
              біз мұғалімдерге сабақтарды дайындауға және оқу процесінің
              әртүрлілігіне көмектесетін әртүрлі оқу материалдарына,
              нұсқаулықтар мен құралдарға қол жеткізуге мүмкіндік береміз.
              <br />
              <span class="text-[#a69781] font-bold"
                >Ынтымақтастық және тәжірибе алмасу:
              </span>
              біз мұғалімдер арасындағы ынтымақтастық пен тәжірибе алмасуды
              ынталандырамыз. Біз мұғалімдер ең жақсы тәжірибелермен бөлісіп,
              бір-біріне қолдау көрсете алатындай алқалық кеңестер,
              педагогикалық үйірмелер мен оқыту семинарларын ұйымдастырамыз.
            </p>
            <p v-if="parents">
              Ата-аналарға <br />
              <span class="text-[#a69781] font-bold">
                Отбасымен серіктестік:</span
              >

              біз ата-аналармен серіктестікті бағалаймыз және оларды білім беру
              процесіне белсенді қатысуға шақырамыз. Біз мектеп пен отбасы
              арасындағы ашық және тиімді қарым-қатынасты қамтамасыз ету үшін
              ата-аналар жиналыстарын, консультацияларды және ата-аналар
              комитеттерін ұйымдастырамыз. <br />
              <span class="text-[#a69781] font-bold">Ақпараттандыру:</span> біз
              ата-аналарға мектептегі іс-шаралар, академиялық жетістіктер мен
              жаңалықтар туралы өзекті ақпарат береміз. Ата-аналар балаларының
              жетістіктері туралы хабардар бола алады және мектеп өміріне қатыса
              алады. <br />
              <span class="text-[#a69781] font-bold">
                Ресурстар және қолдау:
              </span>
              Біз ата-аналарға балаларының білімі мен дамуын қолдауға
              көмектесетін әртүрлі ресурстарға, ақпаратқа және материалдарға қол
              жеткізуді ұсынамыз. Егер сұрақтар немесе қиындықтар туындаса, біз
              ата-аналарға кеңес пен қолдау көрсетеміз.
            </p>
            <p v-if="parents == false && teacher == false && student == false">
              Оқушыларға: <br />
              <span class="text-[#a69781] font-bold"> Сапалы білім:</span>
              біз студенттерге академиялық дағдыларды дамытуға және оқу пәндері
              туралы терең түсінік алуға көмектесетін заманауи әдістер мен
              бағдарламаларға негізделген сапалы білім береміз. Жеке көзқарас:
              біз әр оқушының бірегейлігін бағалаймыз және олардың оқу және жеке
              дамуына жеке қолдау мен көмек көрсетуге тырысамыз. Біздің
              мұғалімдер мен тәрбиешілер әр оқушыға өз мақсаттарына жетуге
              көмектесуге дайын. <br />
              <span class="text-[#a69781] font-bold">
                Әр түрлі сабақтан тыс мүмкіндіктер:</span
              >
              біз студенттердің қызығушылықтары мен таланттарын дамыту үшін әр
              түрлі сабақтан тыс іс-шараларды, спорт клубтарын, өнер
              үйірмелерін, ғылыми жобаларды және басқа да әрекеттерді ұсынамыз.
              <br />
              <span class="text-[#a69781] font-bold"> Болашаққа дайындық:</span>
              біздің мектеп оқушыларды қазіргі әлемде сәтті бейімделуге
              дайындауға тырысады. Біз болашақ мансап пен өмірде пайдалы болатын
              сыни ойлау, қарым-қатынас, ынтымақтастық және проблемалық шешім
              дағдыларын дамытуға баса назар аударамыз.
            </p>
          </div>

          <div>
            <div
              @mouseover="showText('student')"
              @mouseout="hideText"
              class="card text-[#4F4849] border 1px flex items-center p-[15px] rounded-[10px] bg-[#F5F5F3] h-[120px]"
            >
              <img
                src="https://cdn.onlinewebfonts.com/svg/download_146663.png"
                class="w-[70px]"
                alt=""
              />
              <p class="text-[30px] ml-[15px]">Оқушыларға</p>
            </div>
            <div
              @mouseover="showText('parents')"
              @mouseout="hideText"
              class="mt-[15px] card text-[#4F4849] border 1px flex items-center p-[15px] rounded-[10px] bg-[#F5F5F3] h-[120px]"
            >
              <img
                src="https://www.svgrepo.com/show/24067/three-women-two-adults-and-a-child.svg"
                class="w-[70px]"
                alt=""
              />
              <p class="text-[30px] ml-[15px]">Ата-аналарға</p>
            </div>
            <div
              @mouseover="showText('teacher')"
              @mouseout="hideText"
              class="mt-[15px] card text-[#4F4849] border 1px flex items-center p-[15px] rounded-[10px] bg-[#F5F5F3] h-[120px]"
            >
              <img
                src="https://www.svgrepo.com/show/82098/female-teacher.svg"
                class="w-[70px]"
                alt=""
              />
              <p class="text-[30px] ml-[15px]">Мұғалімдерге</p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      student: true,
      teacher: false,
      parents: false,
    };
  },
  methods: {
    showText(target) {
      this.student = target === "student";
      this.teacher = target === "teacher";
      this.parents = target === "parents";
    },
    hideText() {
      this.student = false;
      this.teacher = false;
      this.parents = false;
    },
  },
};
</script>

<style lang="scss" scoped>
.container {
  position: relative;
  max-width: 1200px;
  margin: 0 auto;
}
h1 {
  font-family: "Merriweather", serif;
}
.x {
  font-weight: 700;
}
.card:hover {
  background: #a69781;
  transition: 0.5s;
  color: aliceblue;
  cursor: pointer;
}
</style>
